---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ColumnBaseAttachJustificationParam
source: html/04d7789b-641c-d869-ec13-bc4052d604a6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ColumnBaseAttachJustificationParam Property

"Attachment Justification At Base"

## Syntax (C#)
```csharp
public static ForgeTypeId ColumnBaseAttachJustificationParam { get; }
```